{
    "articles": [
        {
            "author": "Kenny Kline",
            "title": "How This Startup Reached $180 Million Revenue By Not Acting Like a Startup",
            "description": "Mattresses might not be the first thing that comes to mind when one hears the term \"disruptor.\" Even so, The Saatva Company--an online mattress retailer--has been quietly turning revenues that are more likely to engender awe than snores.",
            "long_description": "<p>Mattresses might not be the first thing that comes to mind when one hears the term \"disruptor.\" Even so, The Saatva Company--an online mattress retailer--has been quietly turning revenues that are more likely to engender awe than snores.<\/p>\r\n<p>The company has already found success with its Saatva (innerspring) and Loom &amp; Leaf (memory foam) mattresses: Saatva is the <a target=\"_blank\" rel=\"nofollow\" href=\"http:\/\/www.marketwired.com\/press-release\/saatva-is-seventh-fastest-growing-private-retailer-in-usa-2049549.htm\">seventh-fastest growing private retailer<\/a> in the U.S. and expects to reach <span style=\"display:none\">&nbsp;<\/span><a target=\"_blank\" rel=\"nofollow\" href=\"http:\/\/www.bizjournals.com\/austin\/news\/2016\/05\/17\/how-an-austin-mattress-company-rocketed-to-180m.html\">$180 million in revenue <\/a>this year.<\/p>\r\n<p>As of a few weeks, its founders have started a third brand under the Saatva umbrella. <a target=\"_blank\" rel=\"nofollow\" href=\"https:\/\/www.zenhaven.com\">Zenhaven<\/a> features a line of all-natural latex mattresses designed to compete with top luxury brands at a fraction of the price. The new brand topped $100,000 in sales in its first weekend.<\/p>\r\n<p>All of which begs the question: What's the secret to Saatva's success?<\/p>\r\n<p>The answer, it seems, lies largely with the fact that Saatva has ignored most of today's entrepreneurial norms. Here's a look at how Saatva is rocketing to success by veering off the beaten path.<\/p>\r\n<h2>1. It isn't targeting millennials.<\/h2>\r\n<p>Warby Parker, Casper, Dollar Shave Club--take a look at some of the biggest names in the startup e-commerce world right now, and you'll notice that most of them have one thing in common: They're targeting millennial consumers.<\/p>\r\n<p>But Zenhaven has taken a different approach. \"We found that you can build a really successful business not targeting people under 35,\" says CMO and Co-Founder Ricky Joshi. The brand appeals to its demographic with perks designed for homeowners (such as in-home delivery and installation and old mattress removal) and through luxury marketing.<\/p>\r\n<p>Much like Tesla has done for cars, Saatva has pulled off the impressive feat of targeting mature consumers while simultaneously building a fresh, hip brand.<\/p>\r\n<h2>2. Its founders are cross-generational.<\/h2>\r\n<p>Log onto the \"about us\" page of a lot of big-name startups, and you'll see a sea of twenty- and thirty-something faces. Saatva is different. Its founders span multiple generations--Ron Rudzin is in his fifties, while Ricky Joshi and Kris Brower are in their thirties--and the company has advisors in their sixties.<\/p>\r\n<p>This unusual pairing has proved central to the success of Saatva and Zenhaven. \"Ron already had a consumer goods background and a lot of experience,\" says Joshi. Meanwhile, Joshi and Brower brought digital marketing and social media know-how to the table. By giving each other space to run with their respective strengths, the company has grown organically--and quickly.<\/p>\r\n<p>\"I trust Ron will execute on the mattress and customer service part of the business, and Ron trusts that Kris and I will execute on the e-commerce side,\" says Joshi. \"It's worked amazingly well.\"<\/p>\r\n<h2>3. It's not beholden to investors.<\/h2>\r\n<p>Instead of hopping into bed with investors right out of the gate, the company's founders decided to bootstrap their way to where they are now.<\/p>\r\n<p>\"For the first two or three years, we really weren't even paying ourselves,\" says Joshi. \"I was moonlighting to pay the bills.\" The team also saved money by managing our own advertising accounts, technology infrastructure,,and website from scratch. \"We took on a lot of risk,\" acknowledges Joshi.<\/p>\r\n<p>But with that risk came reward. \"Because we lived and breathed [the company] and weren't beholden to investors, we've been able to make our own decisions,\" says Joshi. \"We haven't followed the normal road. And I think that's why we've grown so fast.\"<\/p>\r\n<h2>4. It's launched multiple brands within a brand.<\/h2>\r\n<p>Most investors advise startups to channel all of their energy into building an increasingly large and cohesive brand, with the ultimate goal of becoming the next Facebook or Amazon. By diversifying across three different brands, Saatva has taken an entirely different approach.<\/p>\r\n<p>\"It's all part of the founders' mission to make decisions that are best for the customer,\" says CEO Rudzin. Segmenting across three brands, he says, \"allows us to give customers a much more immersive experience.\" Each brand offers a different user experience and allows the company's target demographic to self-select per their personal preferences for mattress type and pricing.<\/p>\r\n<p>Diversifying in this way isn't without its downsides. \"The challenge of running three different brands is that there's three of everything--which requires three times the effort,\" says Joshi. Still, Saatva's founders are confident that their decision to launch multiple brands under the same umbrella has been a core component of their success - and so far early <a target=\"_blank\" rel=\"nofollow\" href=\"https:\/\/www.mattressclarity.com\/reviews\/zenhaven\/\">reviews of Zenhaven<\/a> look promising.<\/p>\r\n<h2>5. It's making green living affordable (aka expanding niche markets).<\/h2>\r\n<p>Rudzin is the first to admit that Zenhaven is geared toward a niche market. The brand's mattresses are made from 100% natural American Talalay latex, layered with organic wool, and wrapped in organic cotton. They're also handcrafted in the United States. And until Zenhaven came onto the market, a mattress that met those qualifications could run upwards of $6,000. (In contrast, Zenhaven's Queen size mattress retails for $1,899.)<\/p>\r\n<p>\"We did everything possible to make sure we were American made, American supplied, ethically sourced, and ethically built,\" says Rudzin. \"It did cost us more money.\"<\/p>\r\n<p>But instead of passing that cost onto the consumers, Zenhaven reduces its own overhead by being disciplined with marketing and relying on the lessons learned during Saatva's bootstrapping years.<\/p>\r\n<p>\"The next opportunity in e-commerce is green,\" says Joshi. \"And we want to show people that &nbsp;100% natural doesn't have to cost a million dollars.\"<\/p>\r\n<p>From its product to its customers, Saatva is doing things differently. In the process, it's proving that success can be found by thinking outside the boxspring.&nbsp;<\/p>",
            "url": "https://www.inc.com/kenny-kline/how-this-startup-reached-180-million-revenue-by-not-acting-like-a-startup.html",
            "urlToImage": "https://www.incimages.com/uploaded_files/image/1940x900/getty_119444444_96686.jpg",
            "publishedAt": "2017-09-28T01:00:00Z"
        },
        {
            "author": "marketwired.com",
            "title": "The Saatva Mattress Company Climbs the Ranks on Internet Retailer's Top 500 Guide",
            "description": "Ranks #1 in Merchant Category, Passing Honest Company, GoPro and Warby Parker",
            "url": "http://www.marketwired.com/press-release/the-saatva-mattress-company-climbs-the-ranks-on-internet-retailers-top-500-guide-2116192.htm",
            "long_description": "<p>NEW YORK, NY--(Marketwired - Apr 19, 2016) -  The Saatva Company, the largest and fastest growing online luxury mattress brand in North America was named the fastest growing Consumer Brand Manufacturer in <em>Internet Retailer's 2016 Top 500 Guide<\/em>, and was ranked #300, jumping 198 spots since landing on the 2015 list that ranks the largest online retailers in the U.S, including giants like Amazon, Wal-mart and Apple. <\/p><p>The Saatva Company has set out to change a broken industry by selling mattresses exclusively online since 2010. The Company's unique and successful approach combines old-fashioned customer experience with modern e-commerce efficiencies that cannot be found in retail stores.&nbsp;<\/p><p>The Company's 2015 growth rate exceeding 200% propelled the company to the top of the Consumer Brand Manufacturer list, beating the runner up, Honest Company by nearly triple the growth and outranking top e-Commerce brands such as GoPro, Luxottica and Warby Parker.&nbsp;Additionally, the company was named the 5<sup>th<\/sup> fastest growing e-tailer in the overall ranking. <\/p><p>Top 5 Fastest Growing Consumer Brand Manufacturers in the 2016 Top 500:<\/p><table style=\"width: 70%\"><tbody><tr><td style=\"text-align: center; width: 4%; vertical-align: bottom\">&nbsp;<\/td><td style=\"text-align: left; width: 44%; vertical-align: bottom\">Retailer<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">Top 500 Rank<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">2015 Growth<\/td><\/tr><tr><td style=\"text-align: left; width: 4%; vertical-align: top\">1<\/td><td style=\"text-align: left; width: 44%; vertical-align: bottom\">Saatva Inc.<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">300<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">200.00%<\/td><\/tr><tr><td style=\"text-align: left; width: 4%; vertical-align: top\">2<\/td><td style=\"text-align: left; width: 44%; vertical-align: bottom\">The Honest Company Inc. <\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">132<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">75.00%<\/td><\/tr><tr><td style=\"text-align: left; width: 4%; vertical-align: top\">3<\/td><td style=\"text-align: left; width: 44%; vertical-align: bottom\">GoPro Inc.<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">323<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">50.00%<\/td><\/tr><tr><td style=\"text-align: left; width: 4%; vertical-align: top\">4<\/td><td style=\"text-align: left; width: 44%; vertical-align: bottom\">Luxottica Group S.p.A<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">86<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">50.00%<\/td><\/tr><tr><td style=\"text-align: left; width: 4%; vertical-align: top\">5<\/td><td style=\"text-align: left; width: 44%; vertical-align: bottom\">Warby Parker<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">197<\/td><td style=\"text-align: center; width: 26%; vertical-align: bottom\">50.00%<\/td><\/tr><tr><td style=\"text-align: left; width: 4%; vertical-align: top\">&nbsp;<\/td><td style=\"text-align: right; width: 44%; vertical-align: bottom\">&nbsp;<\/td><td style=\"text-align: right; width: 26%; vertical-align: bottom\">&nbsp;<\/td><td style=\"text-align: right; width: 26%; vertical-align: bottom\">&nbsp;<\/td><\/tr><\/tbody><\/table><p>Key Statistics about The Saatva Company:<br>Named&nbsp;fastest growing e-tailer in the Consumer Brand Manufacturer category<br>Ranked 5<sup>th<\/sup> fastest growing e-tailer in the United States overall<br>Ranked 300<sup>th<\/sup> largest e-commerce company in the 2016 Top 500 Guide<\/p><p>About The Saatva Company<\/p><p>The Saatva Company is devoted to building customer relationships built on providing the best buying experience over a lifetime of mattress purchases and insuring that the customer will never have to go to a mattress store again. The company designs and delivers luxury mattresses through 17 U.S. and Canadian-based factories and 116 fulfillment centers. By cutting out the middleman and retail store markups in the traditional supply chain, the company is able to provide a luxury product at a significantly lower cost than other retailers and with a lot less hassle for customers. <\/p><p>For more information visit <a rel=\"nofollow\" href=\"http:\/\/www.saatvamattress.com\/\"><strong>www.saatvamattress.com<\/strong><\/a> and <a rel=\"nofollow\" href=\"http:\/\/www.loomandleaf.com\/\"><strong>www.loomandleaf.com<\/strong><\/a>.<\/p><p>About Internet Retailer<\/p><p>Now in its 13th year, the data in the Internet Retailer Top 500 Guide® show which North American e-retailers continue to set the standards of excellence in online retailing for web merchants the world over to emulate. These leaders drove U.S. online sales to $286.2 billion in 2015, commanding an 84% share of total U.S. e-commerce sales last year. <\/p>",
            "urlToImage": "http://media.marketwire.com/attachments/201604/95916_saatvalogo.png",
            "publishedAt": "2017-09-28T01:00:00Z"
        },
        {
            "author": "Fiona Byrne",
            "title": "9 Online Start-Ups That Are Changing the Bedding Game",
            "description": "Saatva Mattress",
            "long_description": "<p><strong>What it is:<\/strong> When it launched five years ago, <a target=\"_blank\" href=\"http:\/\/www.saatvamattress.com\/\" rel=\"nofollow\">Saatva Mattress<\/a> was one of the first brands to offer direct-to-consumer mattresses, and while it provides in-home installation, mattress removal, and a 75-day trial, the biggest difference between Saatva and similar  brands is that it gives a choice of three categories\/comfort levels of mattress, from plush soft to firm.<\/p>\r\n<p><strong>Why it’s different:<\/strong> If you have no idea what kind of bed you want to sleep on, Saatva offers a signature Luxury Firm option that it compares to beds used in the finest hotels in the world. The brand’s mattresses also arrive unboxed, so they’re not constrained or altered in any way. <em><a target=\"_blank\" href=\"http:\/\/www.saatvamattress.com\/\" rel=\"nofollow\">saatvamattress.com<\/a><\/em><\/p>",
            "url": "https://www.architecturaldigest.com/gallery/online-start-ups-that-are-changing-the-bedding-game",
            "urlToImage": "https://media.architecturaldigest.com/photos/56ec6ad9dc71add34a9635d2/master/w_640,c_limit/Saatva.jpg",
            "publishedAt": "2017-09-28T01:00:00Z"
        }
    ]
}